var quotations = [
    "火羽小姐的脚，小小的，香香的不像手经常使用来得灵活，但有一种独特的可爱的笨拙嫩嫩的脚丫光滑细腻，凌莹剔透，看得见皮肤下面细细的血管与指甲之下粉白的月牙🥵🥵🥵再高冷的女生小脚也是敏感的害羞的，轻轻挠一挠，她就摇身一变成为娇滴滴的女孩，脚丫像是一把钥匙，轻轻掌握它就能打开女孩子的心灵",
    "火羽大小姐，香香的软软的，唉嘿嘿嘿🥵🥵🥵🥵🥵 ———— 可能是只废喵了",
    "火羽！我的火羽！没有火羽，生命就没有了意义！世界就失去了色彩！灵魂亦得不到安宁！只有听着火羽的声音，看着火羽的笑脸，才能够拯救我那潜藏着无尽深渊的心灵！火羽！火羽就是我的一切！​ ———— 松一琉璃",
    "睡觉的时候打开火羽的视频，熄屏放在胸口，手机沉甸甸的重量仿佛火羽把头靠在我身上，音量调到最小，就是火羽在和我窃窃私语，看完的时候就像火羽躺在我的身边睡着，什么时候我才能真正抱着你，火羽，我的火羽​ ———— ",
    "想对火羽说中午好，但火羽还没开播只能流着眼泪睡去火羽一定会在梦中和我chuchu吧对吧！火羽，你说对吧！———— 我的泪爷",
    "影崩哥哥，今天物理光学开始讲光的特性了，物理老师说光是频率极高的电磁波；又说光是粒子，因为有粒子特性，光到底是什么？ <br>原来<br>光是想你就用尽了全力 ———— 是我安寿哒",
    "斯哈斯哈🥵🥵🥵可爱的火羽，opopop ———— 浅潜幽影",
    "雨水从叶子上滑落，只有我明白那是我思念火羽的泪水，风悄悄的吹过，只有我明白那是我思念火羽的叹息，喔！我的火羽！———— 莫茗曦",
    "我一直躺在大小姐的怀里，吃着大小姐亲手为我削的苹果，大小姐说，啊，张口，让你小心点，口水又流出来了，来，我帮你擦擦，我便盯着大小姐，大小姐便害羞了，后面，大小姐说晚上想去看桃花，说要穿的美美的出去，还害羞得问我说，那个能帮我穿好和服嘛，我说没问题，说完，大小姐脸一红，便跑出去了，趁着大小姐出去，我来和群友们水下群 ———— 全灬神",
    "火羽在我怀里，你摸的是我的腿 ———— 葬爱HKT尼古拉斯刘能",
    "我钻的火羽的被窝摸得火羽的腿🦵亲着火羽的嘴 ———— 小狗狗战士32号",
    "昨晚火羽偷偷溜进我被窝，然后说了一句：让我看看你发育正不正常啊 ———— 風の死龍",
    "今天我辗转反侧睡不着，可能是想念大小姐的关系吧，躺在床上拼命看大小姐切片，以为这样就能忘记大小姐刚刚去厨房做饭的事情，现在还在我身边陪着我，以为看看别的v就没事，但看别的v每个都有大小姐的影子，眼睛越来越大都要炸开了一样，拼命扇自己眼睛，越扇越用力，扇到自己眼泪流出来，真的不知道该怎么办，我真的想大小姐想得要发疯了。你知道吗？每天凌晨，我的眼睛滚烫滚烫，我要狠狠看大小姐，我要让大小姐早点休息睡在我身边，我受不了了，大小姐，我滴大小姐 ———— 没有梦想的一条咸鱼",
    "我躺在icu里想着昨晚在床上被影崩绞杀的场面，现在还有一丝丝后怕，他那硕大无比剑，那恐怖的二头肌，那巧克力般的腹肌，最让人恐惧的是那让人惊恐万分的，会拉丝的胸肌，直接让我喘不过气，不能呼吸，想到这个，我身上又是一身冷汗  ———— 全灬神",
    "有人问我:脸为什么红了，我说看到大小姐胖次所以红了，于是又问我，咋滴又黄了，我便说，桃子吃多了把脸吃黄了 ———— 全灬神",
    "我直接化身为床，被大小姐睡 ———— 叫我五角<br>那我化身为被子，和大小姐依偎在一起 ———— 可能是只废喵了<br>那我化身为空气，抚摸大小姐的一分一厘 ———— Love丶伊卡洛斯",
    "大小姐睡不着要我陪着她，直到哄着她睡着了为止，没办法，为了让大小姐安心睡觉，我只能待会再来水群了  ———— 全灬神",
    "大小姐完全变成了我生活的一部分，我已经没办法离开她了。 —— 椰浆是耶酱",
    "1.不听劝，非说要跟我结婚，恨不得明天就领证<br>2.不安稳，一天只睡几个小时，剩下时间一直缠着我<br>3.占有欲太强，不让我见其他人。<br>4.牵绳子力气有点大<br> —— 黑羊",
    "就像我对影崩的感情就像拉在裤子里一样，虽然路人觉得很臭，但是我会一直把他兜着，怕露在外面把别人吓到，不过他始终会把那份温热给我，这种就是有价值的击剑。 ———— 今天也能抱着咸鱼睡觉吗",
    "大小姐现在正和我在公园里的长凳上坐着，我坐在一边，大小姐躺在椅子上，头靠在我怀里，我还喂着大小姐吃东西，大小姐看得出玩累了，躺在我怀里快睡着了，她今天真的很开心呐！大小姐睡着之前还说，今天和我一起出来玩真的太开心太幸福了，大小姐要永远和我在一起，我听了后也很高兴，刚好大小姐现在睡着了，我才有时间来和群友们分享一下我和大小姐的幸福生活 ———— 全灬神",
    "某天我与火羽停车场路过，突然她和我打招呼，然后和我说她是火羽，届时我问了火羽一句你考驾照了吗？ ———— 風の死龍",
    "我在路上与火羽擦身而过，互不认识对方，突然火羽转身说了一句，我的钱包呢  ———— 風の死龍",
    "就在刚刚我从噩梦中惊醒，抱着我睡觉的大小姐突然被吓醒，连忙坐起身来看着我，问，怎么了做噩梦了嘛，我说，是的我梦见大小姐离我而去了，然后直接被惊醒，现在还久久不能平复，大小姐听了后，擦了擦我脸上的汗，说到，小傻瓜，放心我这辈子都不会离开你的，好了没什么事我们继续睡觉吧，听了大小姐得安慰后我现在平复多了，便继续抱着大小姐睡觉了，只不过这次我抱的更紧了。 ———— 全灬神",
    "今天天气晴朗，我一边吃着大小姐为我准备的爱心便当一边想着大小姐，突然电话响了，一看是大小姐打来的，我说，是不是想我了，大小姐说，便当好吃吗，我好想你我一刻都不想分开你，今天要早点回来哦，我听了后说，只要是你做的都好吃，放心为了不让你感到孤单，我会早点回来的，聊了半个小时后，大小姐不舍的挂了电话，而我吃完大小姐的爱心便当也继续去捡瓶子了  ———— 全灬神",
    "他们跟我说上海下雪了，但是我没有看见。看到消息的我拉开窗帘，并没有看到想象中的雪花飘飘，只看到雨滴打湿的窗户上倒映出我的脸。<br>\
    几年前的上海飘雪，我也没有太大印象了。飘散的雪花没有积起来，与我想象中的冰天雪地相去甚远。<br>\
    后来我在东京第一次看到了理想中的雪，一觉醒来后，飞舞在空中的雪花席卷了熟悉的街道，外面的世界被纯白所覆盖。我很兴奋，兴奋得只穿着单薄的睡衣就走了出门，拿手机拍下好几张图片，然后第一时间传给她。她看着我溢于文字的激动没说什么，毕竟她的家乡每年飘雪，雪景对她来说已是见怪不怪。<br>\
    再后来，她如同消融的雪花一样离开了我的世界，我也回到了上海。之后我去过很多地方，经历过各式各样的雪，但始终没能找回到那天和她撑伞漫步在飘雪东京的感觉。<br>\
    雪终究是雪，是抓握不住的；上海人终究是上海人，无法拥抱雪景。我把对于雪的爱，对于雪的美好回忆，都留在了那天。<br>\
    直到去年，我又遇到了一个女孩，她的房间外常年飘雪，她跟我说，这是因为不想让爱消融。<br>\
    早安，火羽。  ———— 反二战士Azz",
    "火羽为了你我要去乌克兰打仗<br>\
    因为我爱你<br>\
    在我胸口的怀表里面赫然挂着你的照片<br>\
    因为我爱你<br>\
    你是我在黑夜中耀眼的光芒<br>\
    因为我爱你<br>\
    如果没有这场战争我现在已经跟你结婚了甚至孩子都有了<br>\
    但我上了战场<br>\
    我大抵是要交代在这里了<br>\
    如果我不在了<br>\
    变态们可以代替我<br>\
    你也可以是幸福的<br>\
    哪怕我只是一个老鼠<br>\
    ———— 一名反二战士在战死的时候留下来的信封（他反二到了最后一刻）<br>\
    ",
    "舰长快到期了，但我没到期，就算不是舰长了我也会陪着大小姐，天天来看大小姐直播  ———— 全灬神",
];

window.onload = function () {
    var parent_div = document.getElementsByClassName("layui-row")[0]; 
    
    var arr = randomArr(quotations.length, 0, quotations.length);

    for(var i = 0; i < quotations.length; i++) {
        var child_div1 = document.createElement("div");
        child_div1.className = "layui-col-md6";
        var child_div2 = document.createElement("div");
        child_div2.className = "layui-panel";
        var child_div3 = document.createElement("div");
        child_div3.className = "common_content_div";
        child_div3.innerHTML = quotations[arr[i]];
        child_div3.style.padding = "30px";

        child_div2.appendChild(child_div3);
        child_div1.appendChild(child_div2);
        parent_div.appendChild(child_div1);
    }
}
